{"keras_version": "2.2.4", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 12000, 1], "dtype": "float32", "name": "input_12"}, "name": "input_12"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_12", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [3], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 32, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_432", "bias_constraint": null, "activation": "tanh", "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_432"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_432", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 64, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_433", "bias_constraint": null, "activation": "tanh", "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_433"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_433", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_434", "bias_constraint": null, "activation": "tanh", "kernel_size": [5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_434"}, {"class_name": "Dropout", "inbound_nodes": [[["conv1d_434", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "rate": 0.1, "seed": null, "name": "dropout_61"}, "name": "dropout_61"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_61", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [2], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_435", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_435"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_435", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_437", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_437"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_435", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_439", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_439"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_435", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_441", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_441"}, {"class_name": "Lambda", "inbound_nodes": [[["conv1d_435", 0, 0, {}]]], "config": {"trainable": true, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_51", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AABTKQFOqQApAdoBeHIBAAAAcgEAAAD6HzxpcHl0\naG9uLWlucHV0LTY3LTAzYzBiYWFlZDIwND7aCDxsYW1iZGE+BAAAAHMAAAAA\n", null, null]}, "name": "lambda_51"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_435", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_436", "bias_constraint": null, "activation": "tanh", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_436"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_437", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_438", "bias_constraint": null, "activation": "tanh", "kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_438"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_439", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_440", "bias_constraint": null, "activation": "tanh", "kernel_size": [5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_440"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_441", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_442", "bias_constraint": null, "activation": "tanh", "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_442"}, {"class_name": "Concatenate", "inbound_nodes": [[["lambda_51", 0, 0, {}], ["conv1d_436", 0, 0, {}], ["conv1d_438", 0, 0, {}], ["conv1d_440", 0, 0, {}], ["conv1d_442", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_51", "axis": 2}, "name": "concatenate_51"}, {"class_name": "Dropout", "inbound_nodes": [[["concatenate_51", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "rate": 0.1, "seed": null, "name": "dropout_62"}, "name": "dropout_62"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_62", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [2], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_443", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_443"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_443", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_445", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_445"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_443", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_447", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_447"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_443", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_449", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_449"}, {"class_name": "Lambda", "inbound_nodes": [[["conv1d_443", 0, 0, {}]]], "config": {"trainable": true, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_52", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AABTKQFOqQApAdoBeHIBAAAAcgEAAAD6HzxpcHl0\naG9uLWlucHV0LTY3LTAzYzBiYWFlZDIwND7aCDxsYW1iZGE+BAAAAHMAAAAA\n", null, null]}, "name": "lambda_52"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_443", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_444", "bias_constraint": null, "activation": "tanh", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_444"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_445", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_446", "bias_constraint": null, "activation": "tanh", "kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_446"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_447", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_448", "bias_constraint": null, "activation": "tanh", "kernel_size": [5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_448"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_449", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_450", "bias_constraint": null, "activation": "tanh", "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_450"}, {"class_name": "Concatenate", "inbound_nodes": [[["lambda_52", 0, 0, {}], ["conv1d_444", 0, 0, {}], ["conv1d_446", 0, 0, {}], ["conv1d_448", 0, 0, {}], ["conv1d_450", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_52", "axis": 2}, "name": "concatenate_52"}, {"class_name": "Dropout", "inbound_nodes": [[["concatenate_52", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "rate": 0.15, "seed": null, "name": "dropout_63"}, "name": "dropout_63"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_63", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [2], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_451", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_451"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_451", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_453", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_453"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_451", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_455", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_455"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_451", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_457", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_457"}, {"class_name": "Lambda", "inbound_nodes": [[["conv1d_451", 0, 0, {}]]], "config": {"trainable": true, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_53", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AABTKQFOqQApAdoBeHIBAAAAcgEAAAD6HzxpcHl0\naG9uLWlucHV0LTY3LTAzYzBiYWFlZDIwND7aCDxsYW1iZGE+BAAAAHMAAAAA\n", null, null]}, "name": "lambda_53"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_451", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_452", "bias_constraint": null, "activation": "tanh", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_452"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_453", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_454", "bias_constraint": null, "activation": "tanh", "kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_454"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_455", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_456", "bias_constraint": null, "activation": "tanh", "kernel_size": [5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_456"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_457", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_458", "bias_constraint": null, "activation": "tanh", "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_458"}, {"class_name": "Concatenate", "inbound_nodes": [[["lambda_53", 0, 0, {}], ["conv1d_452", 0, 0, {}], ["conv1d_454", 0, 0, {}], ["conv1d_456", 0, 0, {}], ["conv1d_458", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_53", "axis": 2}, "name": "concatenate_53"}, {"class_name": "Dropout", "inbound_nodes": [[["concatenate_53", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "rate": 0.2, "seed": null, "name": "dropout_64"}, "name": "dropout_64"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_64", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [2], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_459", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_459"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_459", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_461", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_461"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_459", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_463", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_463"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_459", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_465", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_465"}, {"class_name": "Lambda", "inbound_nodes": [[["conv1d_459", 0, 0, {}]]], "config": {"trainable": true, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_54", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AABTKQFOqQApAdoBeHIBAAAAcgEAAAD6HzxpcHl0\naG9uLWlucHV0LTY3LTAzYzBiYWFlZDIwND7aCDxsYW1iZGE+BAAAAHMAAAAA\n", null, null]}, "name": "lambda_54"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_459", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_460", "bias_constraint": null, "activation": "tanh", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_460"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_461", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_462", "bias_constraint": null, "activation": "tanh", "kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_462"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_463", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_464", "bias_constraint": null, "activation": "tanh", "kernel_size": [5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_464"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_465", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_466", "bias_constraint": null, "activation": "tanh", "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_466"}, {"class_name": "Concatenate", "inbound_nodes": [[["lambda_54", 0, 0, {}], ["conv1d_460", 0, 0, {}], ["conv1d_462", 0, 0, {}], ["conv1d_464", 0, 0, {}], ["conv1d_466", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_54", "axis": 2}, "name": "concatenate_54"}, {"class_name": "Dropout", "inbound_nodes": [[["concatenate_54", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_65"}, "name": "dropout_65"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_65", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [2], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_467", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_467"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_467", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_469", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_469"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_467", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_471", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_471"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_467", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_473", "bias_constraint": null, "activation": "linear", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_473"}, {"class_name": "Lambda", "inbound_nodes": [[["conv1d_467", 0, 0, {}]]], "config": {"trainable": true, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_55", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AABTKQFOqQApAdoBeHIBAAAAcgEAAAD6HzxpcHl0\naG9uLWlucHV0LTY3LTAzYzBiYWFlZDIwND7aCDxsYW1iZGE+BAAAAHMAAAAA\n", null, null]}, "name": "lambda_55"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_467", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_468", "bias_constraint": null, "activation": "tanh", "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_468"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_469", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_470", "bias_constraint": null, "activation": "tanh", "kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_470"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_471", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_472", "bias_constraint": null, "activation": "tanh", "kernel_size": [5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_472"}, {"class_name": "Conv1D", "inbound_nodes": [[["conv1d_473", 0, 0, {}]]], "config": {"activity_regularizer": null, "padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv1d_474", "bias_constraint": null, "activation": "tanh", "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "name": "conv1d_474"}, {"class_name": "Concatenate", "inbound_nodes": [[["lambda_55", 0, 0, {}], ["conv1d_468", 0, 0, {}], ["conv1d_470", 0, 0, {}], ["conv1d_472", 0, 0, {}], ["conv1d_474", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_55", "axis": 2}, "name": "concatenate_55"}, {"class_name": "Dropout", "inbound_nodes": [[["concatenate_55", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "rate": 0.3, "seed": null, "name": "dropout_66"}, "name": "dropout_66"}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_66", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_2"}, "name": "flatten_2"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "sigmoid", "name": "dense_2"}, "name": "dense_2"}], "input_layers": [["input_12", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_10"}, "backend": "tensorflow"}